"""Создать тестовую запись для Ивана Петрова через API"""
import requests
import json
from datetime import date, timedelta

# Настройки
API_URL = "http://localhost:8000"
# Нужен JWT токен администратора - получите его через веб-интерфейс или бота

def create_test_booking():
    """Создать тестовую запись"""
    print("📋 Создание тестовой записи для Ивана Петрова")
    print("=" * 50)
    
    # TODO: Получите токен через веб-интерфейс
    # 1. Войдите в веб-интерфейс
    # 2. Откройте DevTools (F12)
    # 3. Вкладка Application/Storage → Local Storage → найдите токен
    # 4. Скопируйте значение и вставьте ниже
    
    token = "YOUR_JWT_TOKEN_HERE"
    
    if token == "YOUR_JWT_TOKEN_HERE":
        print("⚠️  Необходимо указать JWT токен!")
        print("\nКак получить токен:")
        print("1. Откройте http://localhost:3000")
        print("2. Войдите как администратор")
        print("3. Откройте DevTools (F12)")
        print("4. Application → Local Storage → найдите 'token'")
        print("5. Скопируйте значение и вставьте в переменную token выше")
        return
    
    headers = {
        "Authorization": f"Bearer {token}",
        "Content-Type": "application/json"
    }
    
    # Завтра в 10:00
    tomorrow = date.today() + timedelta(days=1)
    
    # Сначала нужно найти или создать клиента "Иван Петров"
    # И получить его client_id, service_id и т.д.
    
    print("⚠️  Для создания записи через API нужно:")
    print("   1. Получить client_id для 'Иван Петров'")
    print("   2. Получить service_id (любая активная услуга)")
    print("   3. Создать запись через POST /api/bookings")
    print("   4. Подтвердить запись через PATCH /api/bookings/{id}")
    print("\n💡 Проще создать запись через веб-интерфейс:")
    print("   http://localhost:3000/bookings → + Новая запись")
    print("   - Клиент: Иван Петров")
    print("   - Дата: Завтра")
    print("   - Время: 10:00")
    print("   - Статус: confirmed")


if __name__ == "__main__":
    create_test_booking()
